Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/nomination_to_the_seanad_by_the_taoiseach.html.txt.tmx
Source language: en
Languages: ga

source: Nomination to the Seanad by the Taoiseach
ga: Ainmniúcháin an Taoisigh chuig an Seanad

source: Eleven members of the Seanad are nominated by the Taoiseach
ga: Ainmníonn an Taoiseach aon chomhalta déag den Seanad

source: The Taoiseach can nominate any person who is eligible to become a Senator
ga: Is féidir leis an Taoiseach aon duine atá intofa mar Sheanadóir a ainmniú

source: When the Government is a coalition government, it is usual for the nominations to be shared between the parties in proportion to party strengths
ga: Nuair is comhrialtas atá ann, is iondúil go roinníonn na páirtithe na hainmniúcháin de réir cumhacht na bpáirtithe

source: Normally, the Taoiseach makes his nominations after the other Seanad seats have been filled
ga: Go hiondúil, déanann an Taoiseach daoine a ainmniú nuair atá na suíocháin eile sa Seanad líonta

source: Under the Constitution, 2 Senators may become members of the Government so it is possible for the Taoiseach to nominate a person so that they can be appointed to the Government
ga: De réir an Bhunreachta, is féidir beirt Seanadóir a ainmniú ina mbaill den Rialtas agus mar sin is féidir leis an Taoiseach duine a ainmniú ar mhaithe leis an duine sin a cheapadh mar bhall den Rialtas
